[
  {
    "logo": "cranfield_logo2.png",
    "title": "Cranfield University - <a class='font-bold text-primary hover:text-primary-content' href=\"https://www.cranfield.ac.uk/courses/taught/computational-intelligence-for-data-analytics\" target=\"_blank\">MSc in Computational and Software Techniques in Engineering</a>",
    "description": "MSc at Cranfield University as part of a double degree programme with ISEP. <br/><br/> Cranfield University, located in the UK, is a distinguished public institution exclusively dedicated to postgraduate education and research. It boasts a specialisation in science, engineering, technology, and management, holding the unique distinction of being the UK&#39;s sole postgraduate-only university. <br/><br/> Modules studied: <br/> - Machine Learning and Big Data <br/> - Artificial Intelligence <br/> - High Performance Technical Computing  <br/> - Cloud Computing <br/> - Small-Scale Parallel Programming <br/> - Management for Technology",
    "period": "Sept. 2023 - Sept. 2024"
  },
  {
    "logo": "isep.png",
    "title": "ISEP - <a class\" y font-bold text-primary hover:text-primary-content\" href=\"https://en.isep.fr/studying-at-isep/isep-engineering-master-degree/\" target=\"_blank\">Engineering Master Degree</a>",
    "description": "Engineering cycle at ISEP in Paris. Specialisation in Data Intelligence. <br/><br/> ISEP is a French digital engineering school located in Paris. It trains general engineers in the key fields of digital technology: IT & Cybersecurity - Electronics & Robotics - Telecommunications & Internet of Things - Imaging - Artificial Intelligence.",
    "period": "2021 - 2024"
  },
  {
    "logo": "cvut.png",
    "title": "CVUT - Academic Semester Abroad",
    "description": "Academic semester in English at the Csech Technical University in Prague. <br/><br/> Modules studied: <br/> - Telecommunication Systems and Networks <br/> - Introduction to Cyber Security <br/> - Environmental Engineering  <br/> - Discrete mathematics <br/> - Programming <br/> - English",
    "period": "Feb. 2021 - Jun. 2021"
  },
  {
    "logo": "isep.png",
    "title": "ISEP - <a class=\" y font-bold text-primary hover:text-primary-content\" href=\"https://en.isep.fr/cii/\" target=\"_blank\">International Integrated Cycle (CII)</a>",
    "description": "Preparatory years at the ISEP engineering school in Paris. <br/><br/> The CII follows a programme specific to ISEP, balanced across three teaching areas: Fundamental Digital Sciences | Techniques & Technologies | Languages, Cultures, Humanities and Sustainable Development. It includes an international semester from the second year.",
    "period": "2019 - 2021"
  }
]
